Repository: Ampernic/Cassette
Catalog: po/*.po
Languages: be

source: Unofficial Yandex.Music client for GNOME (Development mode)
be: Неафіцыйны кліент Яндэкс.Музыка для GNOME

source: yandex;yandex music;yam;music;
be: yandex;yandex music;yam;music;яндэкс;яндэкс музыка;ям;музыка;

source: GTK/Adwaita application that allows to use Yandex Music service on Linux operating systems.
be: Праграма GTK/Adwaita, якая дазваляе карыстацца сэрвісам Яндэкс Музыка ў аперацыйных сістэмах Linux.

source: Features:
be: Асаблівасці:

source: Allows you to save playlists and albums for offline listening
be: Дазваляе захоўваць спісы прайгравання і альбомы для праслухоўвання ў аўтаномным рэжыме

source: Has a dynamic "karaoke mode" right in the track information panel
be: Мае дынамічны «рэжым караоке» прама на панэлі інфармацыі аб трэку

source: Allows you to more precisely customize the display and playback of special content, such as explicit or suitable for children.
be: Дазваляе дакладна наладзіць адлюстраванне і прайграванне спецыяльнага кантэнту, напрыклад, нецэнзурнага або прыдатнага для дзяцей.

source: Displays tracks that are currently unavailable in the service
be: Адлюстроўвае трэкі, якія зараз недаступныя ў сэрвісе

source: Shows which tracks have been replaced and by what
be: Паказвае, якія трэкі былі заменены і чым

source: Cassette is an unofficial client and is not associated with or endorsed by Yandex.
be: Cassette з'яўляецца неафіцыйным кліентам, не звязаны з Яндэксам і не падтрымліваецца ім.

source: Unofficial Yandex.Music client
be: Неафіцыйны кліент Яндэкс.Музыка

source: Hotfix
be: Тэрміновыя выпраўленні

source: Crashes that I couldn't reproduce for a long time have been fixed. The reason was an attempt to save a custom track with an empty cover
be: Былі выпраўлены вылеты, якія я доўга не мог паўтарыць. Прычына была ў спробе захавання карыстацкага трэка з пустой вокладкай

source: The button for creating a playlist has changed, as well as some other shadows
be: Змянілася кнопка дадання новага плэйліста, як і некаторыя цені

source: The translation has been corrected. The text on the widgets written using blueprints has not been translated. Now fixed
be: Быў выпраўлены пераклад. Тэкст на віджэтах, напісаных з выкарыстаннем blueprints не быў перакладзены. Цяпер выпраўлена

source: Cosmetic and code changes
be: Касметычныя змены і змены ў кодзе

source: The transition to the blueprints interface language is slowly but surely underway
be: Пераход на мову інтэрфейсу blueprints павольна, але ўпэўнена ідзе

source: The playback panel has been completely redesigned. Now there are fewer buttons (if someone has lost the track information button, you need to poke to the right of the playback slider)
be: Цалкам перароблена панэль прайгравання. Цяпер менш кнопак (калі хтосьці страціў кнопку інфармацыі аб трэку, трэба націснуць справа ад слайдэра прайгравання)

source: The appearance of the playlist has been changed
be: Зменены знешні выгляд плэйліста

source: The sidebar widget has been changed
be: Зменены віджэт бакавой панэлі для паказу дадатковай інфармацыі аб трэку

source: Added the feature with parallel loading of tracks while saving playlists. And not only that, now when the application starts, all saved playlists will be checked and updated. You can also view the progress of saving on the top left
be: Дададзена згаданая месяц таму функцыя з раўналежнай загрузкай трэкаў пры захаванні плэйлістоў. І не толькі гэта, зараз пры старце праграмы, будзе выконваюцца праверка ўсіх захаваных плэйлістоў і іх абнаўленне. Таксама прагледзець прагрэс захавання можна злева зверху

source: Added the removal of a track from the queue when it is disliked
be: Дададзена выдаленне трэка з чаргі пры яго дызлайке

source: The Belarusian language has been added. Thanks to Yahor Haurylenka for the translation
be: Дададзена беларуская мова. Дзякуй Ягору Гаўрыленка за пераклад

source: Added a debug mod
be: Дададзены рэжым адладкі

source: Increased the maximum volume level from 60 to 100
be: Павялічаны максімальны ўзровень гучнасці з 60 да 100

source: Added the ability to move all saved objects to the cache folder, that is, move them to temporary storage
be: Дададзена магчымасць перамяшчаць усе захаваныя аб'екты ў папку з кэшам, гэта значыць перамяшчаць іх у часовае сховішча

source: Other bug fixes
be: Іншыя выпраўленні памылак

source: Added new authorization via WebView
be: Дададзена новая аўтарызацыя праз WebView

source: First release of Cassette
be: Першы выпуск Cassette

source: Allows you to listen to music
be: Дазваляе слухаць музыку

source: View your playlists
be: Прагляд вашых спісаў прайгравання

source: Manage the playback queue, for example shuffle or puts on repeat
be: Кіраванне чаргой прайгравання, напрыклад, перамешванне або паўторнае прайграванне

source: Sends whether the track has been listened to and the playback queue, if it has been changed
be: Адпраўляць інфармацыю аб тым, ці быў праслуханы трэк, і аб чарзе прайгравання, калі яна была зменена

source: Implemented mpris2
be: Рэалізаваны mpris2

source: Unofficial Yandex.Music client for GNOME
be: Неафіцыйны кліент Яндэкс.Музыка для GNOME

# account info window
source: Login: %s
be: Лагін: %s

# account info window
source: Phone number: %s
be: Нумар тэлефона: %s

# account info window
source: Has Plus
be: Падпіска Я.Плюс

# account info window
source: First name: %s
be: Імя: %s

# account info window
source: Second name: %s
be: Прозвішча: %s

# account info window
source: Display name: %s
be: Адлюстраванае імя: %s

# account info window
source: Birthday: %s
be: Дата нараджэння: %s

# account info window
source: Additional options:
be: Дадатковыя параметры:

source: Usage mode
be: Рэжым выкарыстання

# auth window
source: Choose usage mode
be: Выберыце рэжым выкарыстання

# auth window
source: If you select the "Online mode", you can access local music by enabling the display of the corresponding pages in the pages preferences, as well as log in later when selecting "Local mode"
be: Калі вы выберыце «Анлайн-рэжым», вы можаце атрымаць доступ да лакальнай музыкі, уключыўшы адлюстраванне адпаведных старонак у наладах, а таксама ўвайсці пазней, выбраўшы «Лакальны рэжым»

# auth window
source: Online mode
be: Анлайн рэжым

# auth window
source: Local mode
be: Лакальны рэжым

# auth window
source: Close
be: Закрыць

source: Authorization
be: Аўтарызацыя

source: Cache dirs size:
be: Памер каталогаў кэша:

source: Temporary
be: Часовы

source: Clear cache
be: Ачысціць кэш

source: Permanent
be: Пастаянны

source: Move saved
be: Перамясціць захаванае

source: Show all cache jobs
be: Паказаць усе захаванні

source: Title:
be: Назва:

source: Icon:
be: Значок:

source: Save page
be: Захаваць старонку

source: Remove page
be: Выдаліць старонку

# preference window
source: Custom pages
be: Карыстальніцкія старонкі

# preference window
source: Here you can control custom pages.
be: Тут вы можаце кіраваць карыстальніцкімі старонкамі.

source: Disliked tracks
be: Трэкі, якія не спадабаліся

# shortcut window
source: Main Actions
be: Асноўныя дзеянні

# shortcut window
source: Show Shortcuts
be: Спалучэнні клавіш

# shortcut window
source: Quit
be: Выйсці

# shortcut window
source: Media Control
be: Кіраванне прайграваннем

# shortcut window
source: Play/Pause playback
be: Прайграванне/Паўза

# shortcut window
source: Play previous track
be: Прайграць папярэдні трэк

# shortcut window
source: Play next track
be: Прайграйць наступны трэк

# shortcut window
source: Queue control
be: Кантроль чаргі

# shortcut window
source: Change shuffle mode
be: Змяніць рэжым перамешвання

# shortcut window
source: Change repeat mode
be: Змяніць рэжым паўтору

source: Explicit content
be: Непрыстойны кантэнт

source: Child content
be: Дзіцячы кантэнт

source: Connection problems
be: Праблемы з злучэннем

source: Parse URL from clipboard
be: Узяць URL з буфера абмену

source: Preferences
be: Параметры

source: Keyboard Shortcuts
be: Спалучэнні клавіш

source: About Cassette
be: Аб праграме

source: Open in browser
be: Адкрыць у браўзэры

source: Account info
be: Інфармацыя аб уліковым запісе

source: Show track info
be: Паказаць інфармацыю аб трэку

source: Change shuffle mode
be: Змяніць рэжым перамешвання чаргі

source: Play previous track
be: Прайграць папярэдні трэк

source: Play next track
be: Прайграйць наступны трэк

source: Change repeat mode
be: Змяніць рэжым паўтору

source: Show playback queue
be: Паказаць Чаргу прайгравання

source: Change volume
be: Змяніць гучнасць

source: Choose playlist to add
be: Выберыце плэйліст для дадання

source: Create playlist
be: Стварыць плэйліст

source: Start playlist
be: Прайграць плэйліст

source: Add playlist to queue
be: Дадаць плэйліст у чаргу

source: Empty
be: Пусты

source: Play
be: Прайграць

source: Change playlist visibility
be: Змяніць бачнасць плэйліста

source: Add page to header
be: Дадаць старонку ў загаловак

source: Abort
be: Скасаваць

source: Stop
be: Спыніць

source: Your playlists
be: Вашы плэйлісты

source: Also you liked this playlists
be: Вам таксама спадабаліся гэтыя плэйлісты

# preference window
source: Main
be: Галоўнае

# preference window
source: General
be: Агульныя

# preference window
source: Max active threads
be: Максімум актыўных патокаў

# preference window
source: The maximum number of threads for content loading. A large value can affect the performance of the system. The changes will take effect after restarting the application.
be: Максімальная колькасць патокаў для загрузкі кантэнту. Вялікае значэнне можа паўплываць на прадукцыйнасць сістэмы. Змены ўступяць у сілу пасля перазапуску праграмы.

# preference window
source: Try to load queue every window activation
be: Спрабаваць загрузіць чаргу пры кожнай актывацыі акна

# preference window
source: Every time it is expanded or the focus changes from another window queue will loaded from the device on which you listened to music last time.
be: Пры кожным разгортванні або змене фокусу з іншага акна чарга будзе загружацца з прылады, на якой вы слухалі музыку апошні раз.

# preference window
source: Download high quality tracks
be: Спампоўваць трэкі высокай якасці

# preference window
source: Attention! If the track was downloaded in low quality, and after the download is enabled in high quality, the audio will not be reloaded
be: Увага! Калі трэк быў спампаваны ў нізкай якасці, а пасля ўключэння загрузкі ў высокай якасці, аўдыё не будзе перазагружацца

# preference window
source: Add track on top of playlist
be: Дадаваць трэкі ў пачатак плэйліста

# preference window
source: Will the track be added to the playlist as the first or as the last
be: Ці будзе трэк дададзены ў плэйліст як першы або як апошні

# preference window
source: Show additional marks
be: Паказваць дадатковыя адзнакі

# preference window
source: Show save mark
be: Паказваць знак захавання

# preference window
source: Show a mark showing the current state of the track cache
be: Паказваць значок, які паказвае бягучы стан кэша трэкаў

# preference window
source: Show temp save mark
be: Паказваць адзнаку часовага захавання

# preference window
source: Show a mark indicating that the track has been saved to temporary storage
be: Паказаць знак, які паказвае, што трэк быў захаваны ў часовае сховішча

# preference window
source: Show replaced mark
be: Паказваць адзнаку аб тым, што трэк быў заменены

# preference window
source: Show a mark that shows that the track has been replaced
be: Паказваць знак, які паказвае, што трэк быў заменены

# preference window
source: Tracks visibility
be: Бачнасць трэкаў

# preference window
source: Show special tracks in track lists. Filter doesn't work when searching in track list
be: Паказваць трэкі не прызначаных для непаўналетніх або дзіцячага кантэнту ў спісах трэкаў. Фільтр не працуе пры пошуку ў спісе трэкаў

# preference window
source: Show unavailable content
be: Паказваць недаступны кантэнт

# preference window
source: Show tracks that are not available in the service. You can't listen to them
be: Паказваць трэкі, недаступныя ў сэрвісе. Вы не можаце іх праслухаць

# preference window
source: Show content suitable for children
be: Паказваць дзіцячы кантэнт

# preference window
source: Show explicit content
be: Паказваць кантэнт не прызначаны для непаўналетніх

# preference window
source: Other
be: Іншае

# preference window
source: Enable Debug-Mode
be: Уключыць рэжым адладкі

# preference window
source: Experimental
be: Эксперементальныя функцыі

# preference window
source: Force enable mobile mode
be: Прымусова ўключыць мабільны рэжым

# preference window
source: Pages
be: Старонкі

# preference window
source: Static pages
be: Статычныя старонкі

# preference window
source: Here you can show or hide static pages. They will always be displayed on the left side of the header.
be: Тут вы можаце паказваць або хаваць статычныя старонкі. Яны заўсёды будуць адлюстроўвацца з левага боку загалоўка.

# preference window
source: Show "Main" page
be: Паказваць старонку "Галоўнае"

# preference window
source: Show "Liked" page
be: Паказваць старонку "Мне падабаецца"

# preference window
source: Show "Playlists" page
be: Паказваць старонку "Плэйлісты"

# preference window
source: Cache
be: Кэш

# preference window
source: Cache managing
be: Кіраванне кэшам

# preference window
source: Here you can see application memory usage, delete all cache from temp folder and control downloading cache to disk
be: Тут вы можаце пабачыць выкарыстанне памяці праграмай, выдаліць увесь кэш з часовай папкі і кіраваць загрузкай кэша на дыск

# preference window
source: Cache content for better performance (Over time, it starts to take up a lot of space. So far, manual cleaning is required)
be: Кэшаваць кантэнт для павелічэння хуткасці загрузкі (З часам ён пачынае займаць шмат месца. Пакуль што патрабуецца ручная ачыстка)

# preference window
source: If enabled, the application will cache all content in /var/tmp/cassette for better performance, otherwise, the application will load content only when caching objects (such as playlists or albums). Disabling the parameter does not delete already downloaded content
be: Калі ўключана, праграма будзе кэшаваць увесь кантэнт у /var/tmp/cassette для лепшай прадукцыйнасці, інакш праграма будзе загружаць кантэнт толькі пры кэшаванні аб'ектаў (напрыклад, спісаў прайгравання або альбомаў). Адключэнне параметра не выдаляе ўжо спампаваны кантэнт

source: Content saving…
be: Захаванне кантэнту…

source: Content saved to temp folder
be: Кантэнт захаваны ў часовую папку

source: Content saved
be: Кантэнт захаваны

source: Track lyrics
be: Тэкст песні

source: Authors
be: Аўтары

source: Source
be: Крыніца

source: Similar tracks
be: Падобныя трэкі

source: PLAYING
be: ПРАЙГРАВАЕЦЦА

source: Search track
be: Шукаць трэк

source: Sort by
be: Сартаваць па

source: No tracks to display
be: Няма трэкаў для паказу

source: name
be: назве

source: artist
be: выканаўцы

source: album
be: альбому

source: duration
be: працягласці

source: Arseniy Nechkin <krisgeniusnos@gmail.com>
be: Арсеній Нячкін <krisgeniusnos@gmail.com>

source: translator-credits
be: Yahor Haurylenka <k1llo2810@gmail.com> 2023

source: Telegram channel
be: Канал у Telegram

source: Financial support
be: Ахвяраваць

source: Log out?
be: Выйсці з уліковага запісу?

source: You will need to log in again to use the app
be: Вам трэба будзе ўвайсці зноў, каб выкарыстоўваць праграму

source: Cancel
be: Скасаваць

source: Log out
be: Выйсці з уліковага запісу

source: Moving…
be: Перамяшчэнне…

source: Liked
be: Мне падабаецца

source: Daily
be: Плэйліст дня

source: Unknown
be: Невядомы

source: Database was initialized, loc - %s
be: База даных ініцыялізавана, размяшчэнне - %s

source: Can't save object %s
be: Не ўдалося захаваць аб'ект %s

source: Byte
be: Байт

source: Kilobyte
be: Кілобайт

source: Megabyte
be: Мегабайт

source: Gigabyte
be: Гігабайт

source: Terabyte
be: Терабайт

source: Error while getting temporary dir size. Message %s
be: Памылка пры атрыманні часовага памеру каталога. Паведамленне %s

source: Error while getting permanent dir size. Message %s
be: Памылка пры атрыманні пастаяннага памеру каталога. Паведамленне %s

source: Wrong type: expected %s, got %s
be: Няправільны тып: чакаецца %s, атрымана %s

source: Problems with queue
be: Праблемы з чаргой

source: New Playlist
be: Новы плэйліст

source: Error while opening uri: %s
be: Памылка пры адкрыцці URI: %s

source: Connection restored
be: Злучэнне адноўлена

source: Window info message: %s
be: Інфармацыйнае паведамленне аб акне: %s

source: Reconnect
be: Перазлучыцца

source: Can't parse clipboard content
be: Немагчыма разабраць змесціва буфера абмену

source: Users view not implemented yet
be: Прагляд карыстальнікаў яшчэ не рэалізаваны

source: Albums view not implemented yet
be: Прагляд альбомаў яшчэ не рэалізаваны

source: Can't set title "%s" to page
be: Не ўдалося задаць назву "%s" для старонкі

source: Can't set icon with name "%s" to page
be: Не ўдалося задаць на старонку значок з назвай "%s"

source: Reached max page count
be: Дасягнута максімальная колькасць старонак

source: Page '%s' already added
be: Старонка '%s' ужо дададзена

source: Main
be: Галоўнае

source: Playlists
be: Плэйлісты

source: Can't read pages file. Messsage: %s
be: Не ўдалося прачытаць файл старонкі. Паведамленне: %s

source: Can't create pages file. Messsage: %s
be: Не ўдалося стварыць файл старонкі. Паведамленне: %s

source: Not implemented yet
be: Яшчэ не рэалізавана

source: Need authorization
be: Патрэбна аўтарызацыя

source: Need Plus subscription
be: Патрэбна падпіска Яндэкс Плюс

source: Link copied to clipboard
be: Спасылка скапіравана ў буфер абмену

source: Duration: %s h. %s min.
be: Працягласць: %s гадз. %s хв.

source: Duration: %s min.
be: Працягласць: %s хв.

source: today
be: сёння

source: yesterday
be: учора

source: Playlist
be: Плэйліст

source: Album
be: Альбом

source: %d / %d saved%s
be: %d / %d захавана%s

source: . %d track saving now
be: . %d трэк захоўваецца зараз

source: Remove dislike
be: Выдаліць дызлайк

source: Set dislike
be: Паставіць лайк

source: Track was replaced. Original version: %s, %s
be: Трэк быў заменены. Арыгінальная версія: %s, %s

source: Remove like
be: Выдаліць лайк

source: Set like
be: Паставіць лайк

source: Options menu
be: Меню параметраў

source: My wave on playlist
be: Мая хваля па плэйлісту

source: Add to queue
be: Дадаць у чаргу

source: Share
be: Абагуліць

source: Delete playlist
be: Выдаліць плэйліст

source: Play next
be: Прайграць наступным

source: My wave on track
be: Мая хваля па трэку

source: Add to playlist
be: Дадаць у плэйліст

source: Remove from playlist
be: Выдаліць з плэйліста

source: Remove from queue
be: Выдаліць з чаргі

source: Save
be: Захаваць

source: Loading…
be: Загрузка…

source: Play/Pause
be: Іграць/Паўза

source: %s like
be: %s лайк

source: Owner: %s
be: Уладальнік: %s

source: Track count: %s
be: Колькасць трэкаў: %s

source: Delete cache files?
be: Выдаліць кэш?

source: Moved saved files?
be: Перамясціць захаваны кантэнт?

source: All temporary cached files will be deleted. This doesn't affect on saved playlists or albums
be: Увесь часовы кэш будзе выдалены. Гэта не ўплывае на захаваныя плэйлісты або альбомы

source: All saved playlists and albums will be moved to cache files. This could take a while.
be: Усе захаваныя плэйлісты і альбомы будуць перамешчаныя ў файлы кэша. Гэта можа заняць некаторы час.

source: Delete
be: Выдаліць

source: Deleting…
be: Выдаляецца…

source: Delete temporary files?
be: Выдаліць часовыя файлы?

source: All temporary cache will be deleted. This doesn't affect on saved playlists or albums
be: Увесь часовы кэш будзе выдалены. Гэта не ўплывае на захаваныя плэйлісты або альбомы

source: Image
be: Відарыс

source: Track
be: Трэк

source: %s saving…
be: %s захоўваецца…

source: %s saved to temp folder
be: %s захаваны ў часовую папку

source: %s saved
be: %s захаваны

source: PLAYLIST
be: ПЛЭЙЛІСТ

source: ALBUM
be: АЛЬБОМ

source: SEARCH RESULTS
be: РЭЗУЛЬТАТЫ ПОШУКУ

source: Track list
be: Спіс трэкаў

source: Your music track
be: Ваш трэк

source: Music track
be: Трэк

source: Track is not available
be: Трэк недаступны

source: %s%s successfully cached
be: %s%s паспяхова захаваны

source: Caching of %s%s was canceled, due to network error
be: Захаванне %s%s скасавана з-за памылкі сеткі

source: Caching of %s%s was aborted
be: Захаванне %s%s было перарвана

source: Cacheing of %s%s started
be: Пачата захаванне %s%s

source: %s%s was removed from cache folder
be: %s%s быў выдалены з папкі кэша

source: %s%s is removing, please do not close the app
be: %s%s выдаляецца, калі ласка, не закрывайце праграму

source: Error %d
be: Памылка %d

source: Can't load page
be: Не ўдалося загрузіць старонку

source: Can't find desired content
be: Не ўдалося знайсці патрэбнае кантэнт

source: Delete playlist?
be: Выдаліць плэйліст?

source: Playlist '%s' will be permanently deleted.
be: Плэйліст "%s" будзе выдалены назаўсёды.

source: Playlist '%s' was deleted
be: Плэйліст "%s" быў выдалены

source: %s updated playlist %s
be: %s абнавіў плэйліст %s

source: Can't change visibility of '%s'
be: Не ўдалося змяніць бачнасць плэйліста "%s"

source: Playlist '%s' is public now
be: Плэйліст "%s" цяпер агульнадаступны

source: Playlist '%s' is private now
be: Плэйліст "%s" цяпер прыватны
